SilenceLY05/STM32F103HAL/28-触摸画板/电阻屏-触摸画板/User/flash/bsp_spi_flash.h
#ifndef __BSP_SPI_FLASH_H__
#define __BSP_SPI_FLASH_H__

#include "stm32f1xx.h"
#include <stdio.h>


//#define  sFLASH_ID                       0xEF3015     //W25X16
//#define  sFLASH_ID                       0xEF4015	    //W25Q16
#define  sFLASH_ID                         0XEF4017     //W25Q64
//#define  sFLASH_ID                       0XEF4018    //W25Q128


#define SPI_FLASH_PageSize                 256
#define SPI_FLASH_PerWritePageSize         256



/* 命令定义-开头 */
#define W25X_WriteEnable		               0x06 
#define W25X_WriteDisable		               0x04 
#define W25X_ReadStatusReg		             0x05 
#define W25X_WriteStatusReg		             0x01 
#define W25X_ReadData			                 0x03 
#define W25X_FastReadData		               0x0B 
#define W25X_FastReadDual		               0x3B 
#define W25X_PageProgram		               0x02 
#define W25X_BlockErase			               0xD8 
#define W25X_SectorErase		               0x20 
#define W25X_ChipErase			               0xC7 
#define W25X_PowerDown			               0xB9 
#define W25X_ReleasePowerDown	             0xAB 
#define W25X_DeviceID			                 0xAB 
#define W25X_ManufactDeviceID              0x90 
#define W25X_JedecDeviceID		             0x9F


#define WIP_Flag                           0x01       //写标志
#define Dummy_Byte                         0xFF  


#define SPIx                               SPI1
#define SPIx_CLK_ENABLE()                  __HAL_RCC_SPI1_CLK_ENABLE()
#define SPIx_SCK_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOA_CLK_ENABLE()
#define SPIx_MISO_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOA_CLK_ENABLE()
#define SPIx_MOSI_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOA_CLK_ENABLE()
#define SPIx_CS_GPIO_CLK_ENABLE()          __HAL_RCC_GPIOC_CLK_ENABLE()

#define SPIx_FORCE_RESET()                 __HAL_RCC_SPI1_FORCE_RESET()
#define SPIx_RELEASE_RESET()               __HAL_RCC_SPI1_RELEASE_RESET()



#define SPIx_SCK_PIN                       GPIO_PIN_5
#define SPIx_SCK_GPIO_PORT                      GPIOA

#define SPIx_MISO_PIN                      GPIO_PIN_6
#define SPIx_MISO_GPIO_PORT                     GPIOA

#define SPIx_MOSI_PIN                      GPIO_PIN_7
#define SPIx_MOSI_GPIO_PORT                     GPIOA

#define FLASH_CS_PIN                       GPIO_PIN_0
#define FLASH_CS_GPIO_PORT                 GPIOC



#define digitalHi(p,i)                     {p->BSRR=i;}        //设置为高电平
#define digitalLo(p,i)                     {p->BSRR=(uint32_t)i << 16;}    //设置为低电平
#define SPI_FLASH_CS_LOW()                 digitalLo(FLASH_CS_GPIO_PORT,FLASH_CS_PIN)
#define SPI_FLASH_CS_HIGH()                digitalHi(FLASH_CS_GPIO_PORT,FLASH_CS_PIN)


/* 等待超时时间 */
#define SPIT_FLAG_TIMEOUT                  ((uint32_t)0x1000)
#define SPIT_LONG_TIMEOUT                  ((uint32_t)(10*SPIT_FLAG_TIMEOUT))



/*信息输出*/
#define FLASH_DEBUG_ON         1

#define FLASH_INFO(fmt,arg...)           printf("<<-FLASH-INFO->> "fmt"\n",##arg)
#define FLASH_ERROR(fmt,arg...)          printf("<<-FLASH-ERROR->> "fmt"\n",##arg)
#define FLASH_DEBUG(fmt,arg...)          do{\
                                          if(FLASH_DEBUG_ON)\
                                          printf("<<-FLASH-DEBUG->> [%d]"fmt"\n",__LINE__, ##arg);\
                                          }while(0)

																					

																					


void SPI_FLASH_Init(void);
void HAL_SPI_MspInit(SPI_HandleTypeDef* hspi);
uint8_t SPI_FLASH_SendByte(uint8_t byte);
uint8_t SPI_FLASH_ReadByte(void);
uint8_t SPI_FLASH_HalfWord(uint16_t HalfWord);
void SPI_FLASH_WriteEnable(void);
void SPI_FLASH_WaitForWriteEnd(void);
void SPI_FLASH_PowerDown(void);
void SPI_FLASH_WakeUp(void);
void SPI_FLASH_SectorErase(uint32_t SectorAddr);
void SPI_FLASH_BulkErase(void);
void SPI_FLASH_PageWrite(uint8_t *pBuffer,uint32_t WriteAddr,uint16_t NumByteToWrite);
void SPI_FLASH_BufferWrite(uint8_t *pBuffer,uint32_t WriteAddr,uint16_t NumByteToWrite);
void SPI_FLASH_BufferRead(uint8_t *pBuffer,uint32_t ReadAddr,uint16_t NumByteToRead);
uint32_t SPI_FLASH_ReadID(void);
uint32_t SPI_FLASH_ReadDeviceID(void);
void SPI_FLASH_StartReadSequence(uint32_t ReadAddr);





#endif /* __BSP_SPI_FLASH_H__ */


